# Глобальные константы для СКУДа

DB_NAME = "SKUD"
'''Название базы данных СКУДа'''

DB_DIR = ".\\DB\\"
'''Путь к папке с БД'''

SKUD_SCRIPT_PATH = ".\\dbscripts\\skud_script.sql"
'''Путь к скрипту, создающему базу данных'''

ROOT_DIR = "E:\\BlueProject\\"
'''Директория, в которой содержится база данных'''

ARDUINO_PORTS = ["COM6", "COM7"]
'''Список портов, к которым присоединены платы'''

URL = "localhost", 8080
'''Временный адрес для проверки работы вебсервера'''

ROOM_PORT_MAP = {0: "COM6", 1:"COM7"}